Enums/ФизическиеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ФизическиеПоказатели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Грузоподъемность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЗемельныхУчастков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПосадочныхМест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоРаботниковВключаяИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТорговыхАппаратов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТорговыхМест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТранспортныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьЗалаОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьЗемельногоУчастка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьИнформационногоПоля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьПоверхности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьСветоизлучающейПоверхности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьСтоянки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьТорговогоЗала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьТорговогоМеста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлощадьЭкспонирующейПоверхности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредняяЧисленностьНаемныхРаботников</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФизическиеПоказатели/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сравнивает показатели на идентичность (например, если имена показателей являются синонимами).
// Показатели считаются идентичными, если один из них можно заменить другим без потери смысла.
// Например, "Площадь торгового зала" и "Площадь помещения".
//
// Параметры:
//   Показатель1 - ПеречислениеСсылка.ФизическиеПоказатели - сравниваемый показатель
//   Показатель2 - ПеречислениеСсылка.ФизическиеПоказатели - сравниваемый показатель
//
// Возвращаемое значение:
//  Булево - Истина, если показатели заполнены и идентичны.
//
Функция ПоказателиИдентичны(Показатель1, Показатель2) Экспорт
	
	Если Не ЗначениеЗаполнено(Показатель1) Или Не ЗначениеЗаполнено(Показатель2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Показатель1 = Показатель2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИдентичныеПоказатели = ИдентичныеПоказатели();
	
	Возврат ИдентичныеПоказатели[Показатель1] = Показатель2
		Или ИдентичныеПоказатели[Показатель2] = Показатель1;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентичныеПоказатели()
	
	ИдентичныеПоказатели = Новый Соответствие;
	
	ИдентичныеПоказатели.Вставить(КоличествоЗемельныхУчастков, КоличествоОбъектов);
	
	ИдентичныеПоказатели.Вставить(КоличествоТорговыхАппаратов, КоличествоОбъектов);
	ИдентичныеПоказатели.Вставить(КоличествоТорговыхМест, КоличествоОбъектов);
	ИдентичныеПоказатели.Вставить(КоличествоТранспортныхСредств, КоличествоОбъектов);
	
	ИдентичныеПоказатели.Вставить(ПлощадьСтоянки, ПлощадьЗемельногоУчастка);
	
	ИдентичныеПоказатели.Вставить(ПлощадьЗалаОбслуживания, ПлощадьПомещения);
	ИдентичныеПоказатели.Вставить(ПлощадьТорговогоЗала, ПлощадьПомещения);
	ИдентичныеПоказатели.Вставить(ПлощадьТорговогоМеста, ПлощадьПомещения);
	
	ИдентичныеПоказатели.Вставить(ПлощадьИнформационногоПоля, ПлощадьПоверхности);
	ИдентичныеПоказатели.Вставить(ПлощадьСветоизлучающейПоверхности, ПлощадьПоверхности);
	ИдентичныеПоказатели.Вставить(ПлощадьЭкспонирующейПоверхности, ПлощадьПоверхности);
	
	ИдентичныеПоказатели.Вставить(КоличествоРаботниковВключаяИП, СредняяЧисленностьНаемныхРаботников);
	
	Возврат ИдентичныеПоказатели;
	
КонецФункции

#КонецОбласти

#КонецЕсли
